quests = ['Число различных подстановок n-элементного множества, имеющих ровно k циклов в циклическом разложении...\n'
          'a) Число Стирлинга первого рода\n'
          'b) Числом Стирлинга второго рода\n'
          'c) Граф',

          'G1 = (V1, E1) И G2 = (V2, E2) (символически G1 ∪ G2)\n'
          'a) Объединение\n'
          'b) Пересечение\n'
          'c) Перестановка',

          'Теорема (обобщенный принцип Дирихле).\n'
          'a) Для любого множества A справедливо |A| < |P(A)|\n'
          'b) |A| ≤ |B| тогда и только тогда, когда существует инъективное отображение f: A → B\n'
          'c) Свойство P(c, x): ∃a ∈ A ∃b ∈ B c = x и x = {{a}, {a, b}}.',

          'Если в графе G с n ≥ 3 вершинами для любых несмежных вершин u и v выполняется неравенство\n'
          'degGu + degGv ≥ n, то G гамильтонов.\n'
          'a) Теорема Дирака.\n'
          'b) Теорема Оре.\n'
          'c) Теорема Эйлера.']

answ = {'b': 'Число различных подстановок n-элементного множества, имеющих ровно k циклов в циклическом разложении...\n'
             'a) Число Стирлинга первого рода\n'
             'b) Числом Стирлинга второго рода'
             'c) Граф',

        'c': 'G1 = (V1, E1) И G2 = (V2, E2) (символически G1 ∪ G2)\n'
             'a) Объединение\n'
             'b) Пересечение\n'
             'c) Перестановка',

        'a': 'Теорема (обобщенный принцип Дирихле).\n'
             'a) Для любого множества A справедливо |A| < |P(A)|\n'
             'b) |A| ≤ |B| тогда и только тогда, когда существует инъективное отображение f: A → B\n'
             'c) Свойство P(c, x): ∃a ∈ A ∃b ∈ B c = x и x = {{a}, {a, b}}.',

        'b': 'Если в графе G с n ≥ 3 вершинами для любых несмежных вершин u и v выполняется неравенство\n'
             'degGu + degGv ≥ n, то G гамильтонов.\n'
             'a) Теорема Дирака.\n'
             'b) Теорема Оре.\n'
             'c) Теорема Эйлера.'}
