quests = ['...это объединение в одно целое объектов, различимых с помощью интуиции и мысли.\n'
          'a) Подмножество\n'
          'b) Множество\n'
          'c) Бинарное отношение',

          'Законы идемпотентности...\n'
          'a) A ∩ A = A, A ∪ A = A \n'
          'b) A ∩ B = B ∩ A, A ∪ B = B ∪ A, A ∘ B = B ∘ A\n'
          'c) A ∩ (B ∪ C) = (A ∩ B) ∪ (A ∩ C), A ∪ (B ∩ C) = (A ∪ B) ∩ (A ∪ C)',

          'Теорема (обобщенный принцип Дирихле).\n'
          'a) Для любого множества A справедливо |A| < |P(A)|\n'
          'b) |A| ≤ |B| тогда и только тогда, когда существует инъективное отображение f: A → B\n'
          'c) Свойство P(c, x): ∃a ∈ A ∃b ∈ B c = x и x = {{a}, {a, b}}.',

          'Если A равномощно начальному отрезку натуральных чисел Nn = {0, 1, . . ., n − 1}\n'
          ' для некоторого n ∈ N, то A называется:\n'
          'a) Бесконечным\n'
          'b) Конечным.\n'
          'c) Счетным.']

answ = {'b': '...это объединение в одно целое объектов, различимых с помощью интуиции и мысли.\n'
             'a) Подмножество\n'
             'b) Множество\n'
             'c) Бинарное отношение',

        'a': 'Законы идемпотентности...\n'
             'a) A ∩ A = A, A ∪ A = A \n'
             'b) A ∩ B = B ∩ A, A ∪ B = B ∪ A, A ∘ B = B ∘ A\n'
             'c) A ∩ (B ∪ C) = (A ∩ B) ∪ (A ∩ C), A ∪ (B ∩ C) = (A ∪ B) ∩ (A ∪ C)',

        'b': 'Теорема (обобщенный принцип Дирихле).\n'
             'a) Для любого множества A справедливо |A| < |P(A)|\n'
             'b) |A| ≤ |B| тогда и только тогда, когда существует инъективное отображение f: A → B\n'
             'c) Свойство P(c, x): ∃a ∈ A ∃b ∈ B c = x и x = {{a}, {a, b}}.',

        'c': 'Если A равномощно начальному отрезку натуральных чисел Nn = {0, 1, . . ., n − 1}\n'
             ' для некоторого n ∈ N, то A называется:\n'
             'a) Бесконечным\n'
             'b) Конечным.\n'
             'c) Счетным.'}
