quests = ['Кривая совокупного предложения выражает отношение между …\n'
          'a) потребленным и произведенным объемом ВНП в реальном выражении\n'
          'b) уровнем цен и произведенными объемами ВНП в реальном выражении\n'
          'c) уровнем цен, по которым производители желают продавать, а покупатели - покупать',

          'Студенту предложили распространять газеты в выходной день за 10 тыс. рублей.\n'
          'Вместо этого он посетил выставочный зал и кафе и потратил 7 тыс. рублей. Какова альтернативная стоимость выходного дня?\n'
          'a) 10 тыс. рублей\n'
          'b) 17 тыс. рублей\n'
          'c) 3 тыс. рублей',

          'Рынки совершенной и монополистической конкуренции имеют общую черту:\n'
          'a) Выпускаются дифференцированные товары.\n'
          'b) На рынке оперирует множество покупателей и продавцов.\n'
          'c) Каждая фирма сталкивается с горизонтальной кривой спроса на свой продукт.',

          'Предельный доход не ниже рыночной цены y:\n'
          'a) Олигополистов, не участвующих в картеле.\n'
          'b) Монополистов.\n'
          'c) Монополистических конкурентов.']

answ = {'b': 'Кривая совокупного предложения выражает отношение между …\n'
             'a)потребленным и произведенным объемом ВНП в реальном выражении\n'
             'b)уровнем цен и произведенными объемами ВНП в реальном выражении\n'
             'c)уровнем цен, по которым производители желают продавать, а покупатели - покупать',

        'c': 'Студенту предложили распространять газеты в выходной день за 10 тыс. рублей.\n'
             'Вместо этого он посетил выставочный зал и кафе и потратил 7 тыс. рублей. Какова альтернативная стоимость выходного дня?\n'
             'a)10 тыс. рублей\n'
             'b)17 тыс. рублей\n'
             'c)3 тыс. рублей',

        'b': 'Рынки совершенной и монополистической конкуренции имеют общую черту:\n'
          'a) Выпускаются дифференцированные товары.\n'
          'b) На рынке оперирует множество покупателей и продавцов.\n'
          'c) Каждая фирма сталкивается с горизонтальной кривой спроса на свой продукт.',

        'a': 'Предельный доход не ниже рыночной цены y:\n'
          'a) Олигополистов, не участвующих в картеле.\n'
          'b) Монополистов.\n'
          'c) Монополистических конкурентов.\n'}
