quests = ['Кривая совокупного предложения выражает отношение между …\n'
          'a)потребленным и произведенным объемом ВНП в реальном выражении\n'
          'b)уровнем цен и произведенными объемами ВНП в реальном выражении\n'
          'c)уровнем цен, по которым производители желают продавать, а покупатели - покупать',

          'Студенту предложили распространять газеты в выходной день за 10 тыс. рублей.\n'
          'Вместо этого он посетил выставочный зал и кафе и потратил 7 тыс. рублей. Какова альтернативная стоимость выходного дня?\n'
          'a)10 тыс. рублей\n'
          'b)17 тыс. рублей\n'
          'c)3 тыс. рублей']

answ = {'b': 'Кривая совокупного предложения выражает отношение между …\n'
             'a)потребленным и произведенным объемом ВНП в реальном выражении\n'
             'b)уровнем цен и произведенными объемами ВНП в реальном выражении\n'
             'c)уровнем цен, по которым производители желают продавать, а покупатели - покупать',

        'b': 'Студенту предложили распространять газеты в выходной день за 10 тыс. рублей.\n'
             'Вместо этого он посетил выставочный зал и кафе и потратил 7 тыс. рублей. Какова альтернативная стоимость выходного дня?\n'
             'a)10 тыс. рублей\n'
             'b)17 тыс. рублей\n'
             'c)3 тыс. рублей'}
